Tekla.Structures.ModelInternal.Dstv.DstvHoleRow
The dstv hole information

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.#ctor
Creates a new DstvHoleRow instance.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.DstvView
The dstv view type: front, top, back or below

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Position
The position of the hole.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.HoleType
The hole type.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Diameter
The diameter of the hole.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Thickness
The thread in material value.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Slotted
True if slotted, otherwise false.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Width
The width of the slotted hole.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Height
The height.

Tekla.Structures.ModelInternal.Dstv.DstvHoleRow.Angle
The angle.